#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Основание");	
		Если ЗначениеЗаполнено(Основание) Тогда
			Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "УчитыватьТолькоИстекающие", Ложь) Тогда
				ЗаполнитьПоВыдачеСИЗ(Основание);
			ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "УчитыватьТолькоОтмеченные", Ложь) Тогда
				ЗаполнитьПоВыдачеСИЗ(Основание, Ложь);
			Иначе
				ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка, Основание);
			КонецЕсли;
		Иначе
			ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, Дата, "Объект.Дата", Отказ, НСтр("ru='Дата продления'"), , , Ложь);
	
	ОхранаТруда.ОбработкаПроверкиЗаполненияКомиссии(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Для Индекс = 0 По РабочиеМеста.Количество()-1 Цикл
		СтрокаРабочееМесто = РабочиеМеста.Получить(Индекс);
		СтрокиНоменклатурыРабочегоМеста = НоменклатураСИЗ.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста));
		
		Для Каждого СтрокаНоменклатураСИЗ Из СтрокиНоменклатурыРабочегоМеста Цикл
			Если Не ЗначениеЗаполнено(СтрокаНоменклатураСИЗ.Номенклатура) И СтрокаНоменклатураСИЗ.Продлить Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Сотруднику ""%1"" не установлена номенклатура для продления по СИЗ ""%2""'"),
					СтрокаРабочееМесто.ФизическоеЛицо, СтрокаНоменклатураСИЗ.СИЗ);
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"РабочиеМеста", СтрокаРабочееМесто.НомерСтроки, "ФизическоеЛицо");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	ИдентификаторыСтрокРабочихМест = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из РабочиеМеста Цикл
		ИдентификаторыСтрокРабочихМест.Вставить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста, СтрокаТаблицы);
	КонецЦикла;
	ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		Если Не СтрокаТаблицы.Продлить Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабора = Движения.ВыдачиСИЗПоНоменклатуре.Добавить();
		ЗаписьНабора.Период = Дата;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.СрокНоскиПродлен;
		ЗаписьНабора.ОснованиеВыдачи = СтрокаТаблицы.ОснованиеВыдачи;
		ЗаписьНабора.ДокументВыдачи = СтрокаТаблицы.ДокументВыдачи;
		ЗаписьНабора.ДатаСледующейВыдачи = СтрокаТаблицы.ДатаСледующейВыдачи;
		Движения.ВыдачиСИЗПоНоменклатуре.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка, Основание = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Основание) Тогда
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, Подразделение, Дата");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования, , "Дата");
		ЗаполнитьЗначенияПоУмолчанию();
		ЗаполнитьСИЗКПродлению(Документы.ВыдачаСИЗ.ФизическиеЛицаРабочиеМестаВыдачи(Основание), "РабочееМесто", , , РеквизитыОснования.Дата);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ЗаполнитьЗначенияПоУмолчанию();
		Если ДанныеЗаполнения.Свойство("ФизическиеЛицаРабочиеМеста") Тогда
			ЗаполнитьСИЗКПродлению(ДанныеЗаполнения.ФизическиеЛицаРабочиеМеста, "РабочееМесто");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗ(ИдентификаторыСИЗ) Экспорт
	
	НоменклатураСИЗ.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСИЗ = ИдентификаторыСИЗ.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСИЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСИЗ Из МассивСИЗ Цикл
			Если ДанныеСИЗ.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = НоменклатураСИЗ.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСИЗ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗКПродлению(ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, Сч = 1, ДобавлятьБезСИЗ = Ложь, ДатаАктуальности = Неопределено) Экспорт
	
	ОтмеченныеСИЗ = Неопределено;
	ТаблицаФизическиеЛицаРабочиеМеста = СредстваИндивидуальнойЗащиты.ТаблицаФизическиеЛицаРабочиеМеста(
		ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, ОтмеченныеСИЗ);
	
	Если ТаблицаФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = Дата;
	КонецЕсли;
	
	ВыданныеСИЗ = СредстваИндивидуальнойЗащиты.ВыданныеСИЗ(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности, ОтмеченныеСИЗ);
	Для Каждого ДанныеСИЗ Из ТаблицаФизическиеЛицаРабочиеМеста Цикл
		СИЗРабочихМест = ВыданныеСИЗ.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
		ЕстьСИЗ = Ложь;
		ПоследниеВыдачиСИЗ = СредстваИндивидуальнойЗащиты.ПоследниеВыдачиСИЗПоНоменклатуре(
			ДанныеСИЗ.ФизическоеЛицо, Организация, ДатаАктуальности);
		Для Каждого НайденныйСИЗ Из СИЗРабочихМест Цикл
			Если НайденныйСИЗ.Количество <= 0 Или НайденныйСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденныйСИЗ);
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = Сч;
			Если ПоследниеВыдачиСИЗ <> Неопределено Тогда
				ПоследняяВыдачаСИЗ = ПоследниеВыдачиСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ);
				Если ПоследняяВыдачаСИЗ <> Неопределено Тогда
					НоваяСтрокаСИЗ.ПоследняяВыдача = ПоследняяВыдачаСИЗ.Период;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаСИЗ.ДатаСледующейВыдачи = Дата;
			ЕстьСИЗ = Истина;
		КонецЦикла;
		Если Не ЕстьСИЗ Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		НоваяСтрока.ФизическоеЛицо = ДанныеСИЗ.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ДанныеСИЗ.РабочееМесто;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.РабочееМесто, "Подразделение,Должность"));
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоВыдачеСИЗ(ДокументСсылка, ТолькоИстекающие = Истина)
	
	РеквизитыШапки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация, Подразделение");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
	
	СредстваИндивидуальнойЗащиты.ЗаполнитьДокументПоВыдачеСИЗ(
		ЭтотОбъект, ДокументСсылка, Перечисления.ДействияСИстекающимиСИЗ.ПродлитьСрокНоски, ТолькоИстекающие);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли