////////////////////////////////////////////////////////////////////////////////
// Подсистема "Выгрузка загрузка данных".
// 
// Процедуры и функции данного модуля позволяют выгружать и загружать
// границы последовательностей.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик события перед выгрузкой типа.
// 
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
//	Сериализатор - СериализаторXDTO
//	ОбъектМетаданных - ОбъектМетаданных
//	Отказ - Булево
//
Процедура ПередВыгрузкойТипа(Контейнер, Сериализатор, ОбъектМетаданных, Отказ) Экспорт
	
	Если ОбщегоНазначенияБТС.ЭтоНаборЗаписейПоследовательности(ОбъектМетаданных) Тогда
		
		Отбор     = Новый Массив;
		Состояние = Неопределено;
		
		Пока Истина Цикл
			
			МассивТаблиц = ПолучитьПорциюДанныхНезависимогоНабораЗаписей(
				ОбъектМетаданных, Отбор, 10000, Ложь, Состояние, ".Границы"); // @query-part-1
			
			Если МассивТаблиц.Количество() <> 0 Тогда
				
				ПерваяТаблица = МассивТаблиц.Получить(0); // ТаблицаЗначений
				
				КоличествоЗаписей = ПерваяТаблица.Количество();
				
				ИмяФайла = Контейнер.СоздатьФайл(ВыгрузкаЗагрузкаДанныхСлужебный.SequenceBoundary(), ОбъектМетаданных.ПолноеИмя());
				ВыгрузкаЗагрузкаДанных.ЗаписатьОбъектВФайл(ПерваяТаблица, ИмяФайла);
				Контейнер.УстановитьКоличествоОбъектов(ИмяФайла, КоличествоЗаписей);
				Контейнер.ФайлЗаписан(ИмяФайла);
				
				Продолжить;
				
			КонецЕсли;
			
			Прервать;
		
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Объект метаданных %1 не может быть обработан обработчиком %2'"),
			ОбъектМетаданных.ПолноеИмя(),
			"ВыгрузкаЗагрузкаДанныхГраницПоследовательностей.ПередВыгрузкойТипа");
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при регистрации произвольных обработчиков загрузки данных.
// В данной процедуре требуется дополнить таблицу значений информацией о регистрируемых 
// произвольных обработчиках загрузки данных. 
//
// Параметры:
//  ТаблицаОбработчиков - ТаблицаЗначений - Колонки:
//		* ОбъектМетаданных - ОбъектМетаданных - при загрузке данных которого должен вызываться регистрируемый обработчик
//    	* Обработчик - ОбщийМодуль - общий модуль, в котором реализован произвольный
//       	обработчик загрузки данных. Набор экспортных процедур, которые должны
//       	быть реализованы в обработчике, зависит от установки значений следующих
//       	колонок таблицы значений.
//    	* Версия - Строка - номер версии интерфейса обработчиков выгрузки / загрузки данных,
//       	поддерживаемого обработчиком.
//    	* ПередСопоставлениемСсылок - Булево - флаг необходимости вызова обработчика перед
//       	сопоставлением ссылок (в исходной ИБ и в текущей), относящихся к данному объекту
//       	метаданных. Если присвоено значение Истина - в общем модуле обработчика должна
//       	быть реализована экспортируемая процедура ПередСопоставлениемСсылок(),
//       	поддерживающая следующие параметры:
//        		Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//          		контейнера, используемый в процессе загрузки данных. Подробнее см. комментарий
//          		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//        		ОбъектМетаданных - ОбъектМетаданных - перед сопоставлением ссылок которого
//          		был вызван обработчик,
//        		СтандартнаяОбработка - Булево - Если процедуре ПередСопоставлениемСсылок()
//          		установить значение данного параметра равным Ложь, вместо стандартного
//          		сопоставления ссылок (поиск объектов в текущей ИБ с теми же значениями
//          		естественного ключа, которые были выгружены из ИБ-источника) будет
//          		вызвана функция СопоставитьСсылки() общего модуля, в процедуре
//          		ПередСопоставлениемСсылок() которого значение параметра СтандартнаяОбработка
//          		было установлено равным Ложь.
//          		Параметры функции СопоставитьСсылки():
//            			Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//              			контейнера, используемый в процессе загрузки данных. Подробнее см. комментарий
//              			к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера,
//            			ТаблицаИсходныхСсылок - ТаблицаЗначений - содержащая информацию о ссылках,
//              			выгруженных из исходной ИБ. Колонки:
//                		ИсходнаяСсылка - ЛюбаяСсылка - ссылка объекта исходной ИБ, которую требуется
//                  		сопоставить c ссылкой в текущей ИБ,
//                	Остальные колонки равным полям естественного ключа объекта, которые в
//                  процессе выгрузки данных были переданы в функцию
//                  Обработка.ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы.ТребуетсяСопоставитьСсылкуПриЗагрузке()
//          Возвращаемое значение функции СопоставитьСсылки() - ТаблицаЗначений, колонки:
//            ИсходнаяСсылка - ЛюбаяСсылка -  ссылка объекта, выгруженная из исходной ИБ,
//            Ссылка - ЛюбаяСсылка - сопоставленная исходной ссылка в текущей ИБ.
//        	Отказ - Булево - если в процедуре ПередСопоставлениемСсылок() установить значение
//          	данного параметра равным Истина - сопоставление ссылок, соответствующих
//          	текущему объекту метаданных, выполняться не будет.
//		* ПередЗагрузкойТипа - Булево - флаг необходимости вызова обработчика перед
//       	загрузкой всех объектов данных, относящихся к данному объекту
//       	метаданных. Если присвоено значение Истина - в общем модуле обработчика должна
//       	быть реализована экспортируемая процедура ПередЗагрузкойТипа(),
//       	поддерживающая следующие параметры:
//        		Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//          		контейнера, используемый в процессе загрузки данных. Подробнее см. комментарий
//          		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//        		ОбъектМетаданных - ОбъектМетаданных - перед загрузкой всех данных которого
//          		был вызван обработчик,
//        		Отказ - Булево - если в процедуре ПередЗагрузкойТипа() установить значение данного
//          		параметра равным Истина - загрузка всех объектов данных соответствующих текущему
//          		объекту метаданных выполняться не будет.
//		* ПередЗагрузкойОбъекта - Булево - флаг необходимости вызова обработчика перед
//       	загрузкой объекта данных, относящихся к данному объекту
//       	метаданных. Если присвоено значение Истина - в общем модуле обработчика должна
//       	быть реализована экспортируемая процедура ПередЗагрузкойОбъекта(),
//       	поддерживающая следующие параметры:
//        		Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//          		контейнера, используемый в процессе загрузки данных. Подробнее см. комментарий
//          		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//        		Объект - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект,
//          		БизнесПроцессОбъект, ЗадачаОбъект, ПланСчетовОбъект, ПланОбменаОбъект,
//          		ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей,
//          		РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей,
//          		РегистрРасчетаНаборЗаписей, ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей -
//          		объект данных информационной базы, перед загрузкой которого был вызван обработчик.
//          		Значение, переданное в процедуру ПередЗагрузкойОбъекта() в качестве значения параметра
//          		Объект может быть модифицировано внутри процедуры обработчика ПередЗагрузкойОбъекта().
//        		Артефакты - Массив Из ОбъектXDTO - дополнительные данные, логически неразрывно связанные
//          		с объектом данных, но не являющиеся его частью. Сформированы в экспортируемых процедурах
//          		ПередВыгрузкойОбъекта() обработчиков выгрузки данных (см. комментарий к процедуре
//          		ПриРегистрацииОбработчиковВыгрузкиДанных(). Каждый артефакт должен являться XDTO-объектом,
//          		для типа которого в качестве базового типа используется абстрактный XDTO-тип
//          		{http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1}Artefact. Допускается использовать XDTO-пакеты,
//          		помимо изначально поставляемых в составе подсистемы ВыгрузкаЗагрузкаДанных.
//        		Отказ - Булево - если в процедуре ПередЗагрузкойОбъекта() установить значение данного
//          		параметра равным Истина - загрузка объекта данных выполняться не будет.
//		* ПослеЗагрузкиОбъекта - Булево - флаг необходимости вызова обработчика после
//       	загрузки объекта данных, относящихся к данному объекту
//       	метаданных. Если присвоено значение Истина - в общем модуле обработчика должна
//       	быть реализована экспортируемая процедура ПослеЗагрузкиОбъекта(),
//       	поддерживающая следующие параметры:
//        		Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//          		контейнера, используемый в процессе загрузки данных. Подробнее см. комментарий
//          		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//        		Объект - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект,
//          		БизнесПроцессОбъект, ЗадачаОбъект, ПланСчетовОбъект, ПланОбменаОбъект,
//          		ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей,
//          		РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей,
//          		РегистрРасчетаНаборЗаписей, ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей -
//          		объект данных информационной базы, после загрузки которого был вызван обработчик.
//        		Артефакты - Массив Из ОбъектXDTO - дополнительные данные, логически неразрывно связанные
//          		с объектом данных, но не являющиеся его частью. Сформированы в экспортируемых процедурах
//          		ПередВыгрузкойОбъекта() обработчиков выгрузки данных (см. комментарий к процедуре
//          		ПриРегистрацииОбработчиковВыгрузкиДанных(). Каждый артефакт должен являться XDTO-объектом,
//          		для типа которого в качестве базового типа используется абстрактный XDTO-тип
//          		{http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1}Artefact. Допускается использовать XDTO-пакеты,
//          		помимо изначально поставляемых в составе подсистемы ВыгрузкаЗагрузкаДанных.
//		* ПослеЗагрузкиТипа - Булево - флаг необходимости вызова обработчика после
//       	загрузки всех объектов данных, относящихся к данному объекту
//       	метаданных. Если присвоено значение Истина - в общем модуле обработчика должна
//       	быть реализована экспортируемая процедура ПослеЗагрузкиТипа(),
//       	поддерживающая следующие параметры:
//        		Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//          		контейнера, используемый в процессе загрузки данных. Подробнее см. комментарий
//          		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//        		ОбъектМетаданных - ОбъектМетаданных - после загрузки всех объектов которого
//          		был вызван обработчик.
//
Процедура ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков) Экспорт
	
	Для Каждого Последовательность Из Метаданные.Последовательности Цикл
		
		НовыйОбработчик = ТаблицаОбработчиков.Добавить();
		НовыйОбработчик.ОбъектМетаданных = Последовательность;
		НовыйОбработчик.Обработчик = ВыгрузкаЗагрузкаДанныхГраницПоследовательностейСлужебный;
		НовыйОбработчик.ПослеЗагрузкиТипа = Истина;
		НовыйОбработчик.Версия = ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ВерсияОбработчиков1_0_0_1();
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПослеЗагрузкиТипа(Контейнер, ОбъектМетаданных) Экспорт
	
	Если ОбщегоНазначенияБТС.ЭтоНаборЗаписейПоследовательности(ОбъектМетаданных) Тогда
		
		МенеджерПоследовательности = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
			ОбъектМетаданных.ПолноеИмя()); // ПоследовательностьМенеджерИмяПоследовательности 
		
		ФайлыГраниц = Контейнер.ПолучитьФайлыИзКаталога(
			ВыгрузкаЗагрузкаДанныхСлужебный.SequenceBoundary(), ОбъектМетаданных.ПолноеИмя());
		
		Для Каждого ФайлГраниц Из ФайлыГраниц Цикл
			
			ТаблицаГраниц = Контейнер.ПрочитатьОбъектИзФайла(ФайлГраниц);
			
			Для Каждого СтрокаТаблицы Из ТаблицаГраниц Цикл 
				
				КлючПоследовательности = ПолучитьКлючПоследовательности(ОбъектМетаданных, СтрокаТаблицы);
				
				МоментВремени = Новый МоментВремени(СтрокаТаблицы.Период, СтрокаТаблицы.Регистратор);
				МенеджерПоследовательности.УстановитьГраницу(МоментВремени, КлючПоследовательности);
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Объект метаданных %1 не может быть обработан обработчиком %2'"),
			ОбъектМетаданных.ПолноеИмя(),
			"ВыгрузкаЗагрузкаДанныхГраницПоследовательностей.ПослеЗагрузкиТипа");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить порцию данных независимого набора записей.
// 
// Параметры: 
//  МетаданныеОбъекта - ОбъектМетаданных
//  Отбор - Массив Из Структура:
//  * ВидСравнения - ВидСравнения
//  * Поле - Строка
//  * Значение - Произвольный
//  РазмерПорции - Число
//  МожноПродолжать - Булево
//  Состояние - см. ИнициализироватьСостояниеДляВыборкиПорцийНезависимогоНабораЗаписей
//  ДополнениеКИмениТаблицы - Строка
// 
// Возвращаемое значение: 
//  Массив из ТаблицаЗначений:
//   * Колонка - Произвольный - произвольный набор колонок - полей объекта.
//
Функция ПолучитьПорциюДанныхНезависимогоНабораЗаписей(
	МетаданныеОбъекта,
	Знач Отбор,
	РазмерПорции,
	МожноПродолжать,
	Состояние,
	ДополнениеКИмениТаблицы = "")
	
	Если Состояние = Неопределено Тогда
		Состояние = ИнициализироватьСостояниеДляВыборкиПорцийНезависимогоНабораЗаписей(МетаданныеОбъекта, Отбор, 
			ДополнениеКИмениТаблицы);
		МожноПродолжать = Истина;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	ОсталосьПолучить = РазмерПорции; // Осталось получить в этой порции
	
	ПерваяВыборка = Ложь;
	
	ТекущийЗапрос = 0; // Индекс текущего запроса
	
	Пока Истина Цикл // Получение фрагментов порций
		ФрагментПорции = Неопределено; // Последний полученный фрагмент порции
		
		Если НЕ Состояние.БылаВыборка Тогда // Первый запрос
			Состояние.БылаВыборка = Истина;
			ПерваяВыборка = Истина;
			
			Запрос = Новый Запрос;
			Запрос.Текст = СтрЗаменить(Состояние.Запросы.Первый, "999", Формат(ОсталосьПолучить, "ЧГ="));
		Иначе
			Запрос = Новый Запрос;
			Если Состояние.Запросы.Последующие.Количество() <> 0 Тогда 
				ОписаниеЗапроса = Состояние.Запросы.Последующие[ТекущийЗапрос];
				ТекущийЗапрос = ТекущийЗапрос + 1;
				Запрос.Текст = СтрЗаменить(ОписаниеЗапроса.Текст, "999", Формат(ОсталосьПолучить, "ЧГ="));
				Если ОписаниеЗапроса.ПоляУсловия <> Неопределено Тогда 
					Для Каждого ПолеУсловия Из ОписаниеЗапроса.ПоляУсловия Цикл
						Запрос.УстановитьПараметр(ПолеУсловия, Состояние.Ключ[ПолеУсловия]);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ПараметрОтбора Из Состояние.Запросы.Параметры Цикл
			Запрос.УстановитьПараметр(ПараметрОтбора.Ключ, ПараметрОтбора.Значение);
		КонецЦикла;
		
		Если Не ПустаяСтрока(Запрос.Текст) Тогда 
			ФрагментПорции = Запрос.Выполнить().Выгрузить();
			
			РазмерФрагмента = ФрагментПорции.Количество();
		Иначе
			РазмерФрагмента = 0;
		КонецЕсли;
		
		Если РазмерФрагмента > 0 Тогда
			Результат.Добавить(ФрагментПорции);
			
			ЗаполнитьЗначенияСвойств(Состояние.Ключ, ФрагментПорции[РазмерФрагмента - 1]);
		КонецЕсли;
		
		Если РазмерФрагмента < ОсталосьПолучить Тогда
			
			Если НЕ ПерваяВыборка // Если это был первый запрос - нет смысла продолжать
				И ТекущийЗапрос < Состояние.Запросы.Последующие.Количество() Тогда
				
				ОсталосьПолучить = ОсталосьПолучить - РазмерФрагмента;
				
				Продолжить; // Переход к следующему запросу
			Иначе
				МожноПродолжать = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
// 	МетаданныеОбъекта - ОбъектМетаданныхРегистрСведений, ОбъектМетаданныхПоследовательность - объект выборки.
//  Отбор - Массив Из Структура:
//  * ВидСравнения - ВидСравнения
//  * Поле - Строка
//  * Значение - Произвольный
// 	ДополнениеКИмениТаблицы - Строка - дополнение.
// Возвращаемое значение:
// 	Структура:
// * БылаВыборка - Булево
// * Ключ - Структура - структура для хранения значения последнего ключа.
// * Запросы - ФиксированнаяСтруктура - описания запросов:
//		** Первый - Строка - текст запроса получения первой порции.
//		** Последующие - ФиксированныйМассив из ФиксированнаяСтруктура - последующие запросы.
//		** Параметры - Структура - параметры отбора.
Функция ИнициализироватьСостояниеДляВыборкиПорцийНезависимогоНабораЗаписей(
	МетаданныеОбъекта, Знач Отбор, ДополнениеКИмениТаблицы = "")
	
	ЭтоРегистрСведений    = Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта);
	
	ЭтоПоследовательность = Метаданные.Последовательности.Содержит(МетаданныеОбъекта);
	
	ПоляКлюча = Новый Массив; // Поля образующие ключ записи
	
	Если ЭтоРегистрСведений И МетаданныеОбъекта.ПериодичностьРегистраСведений 
		<> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		
		ПоляКлюча.Добавить("Период");
	КонецЕсли;
	
	Если ЭтоПоследовательность Тогда 
		
		ПоляКлюча.Добавить("Регистратор");
		ПоляКлюча.Добавить("Период");
		
	КонецЕсли;
	
	ДобавитьРазделителиВКлюч(МетаданныеОбъекта, ПоляКлюча);
	
	Для каждого МетаданныеИзмерения Из МетаданныеОбъекта.Измерения Цикл
		ПоляКлюча.Добавить(МетаданныеИзмерения.Имя);
	КонецЦикла;
	
	ПоляВыборки = Новый Массив; // Все поля
	
	Если ЭтоРегистрСведений Тогда 
		
		Для Каждого МетаданныеРесурса Из МетаданныеОбъекта.Ресурсы Цикл
			ПоляВыборки.Добавить(МетаданныеРесурса.Имя);
		КонецЦикла;
		
		Для Каждого МетаданныеРеквизита Из МетаданныеОбъекта.Реквизиты Цикл
			ПоляВыборки.Добавить(МетаданныеРеквизита.Имя);
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого ПолеКлюча Из ПоляКлюча Цикл
		ПоляВыборки.Добавить(ПолеКлюча);
	КонецЦикла;
	
	ПсевдонимТаблицы = "_ТаблицаНабораЗаписей"; // Псевдоним таблицы в тексте запроса
	
	СтрокаПолейВыборки = ""; // Часть текста запроса с полями выборки
	Для каждого ПолеВыборки Из ПоляВыборки Цикл
		Если НЕ ПустаяСтрока(СтрокаПолейВыборки) Тогда
			СтрокаПолейВыборки = СтрокаПолейВыборки + "," + Символы.ПС;
		КонецЕсли;
		
		СтрокаПолейВыборки = СтрокаПолейВыборки + Символы.Таб + ПсевдонимТаблицы + "." + ПолеВыборки + " КАК " + ПолеВыборки;
	КонецЦикла;
	
	СтрокаПолейУпорядочивания = ""; //Часть текста запроса с полями упорядочивания
	Для каждого ПолеКлюча Из ПоляКлюча Цикл
		Если НЕ ПустаяСтрока(СтрокаПолейУпорядочивания) Тогда
			СтрокаПолейУпорядочивания = СтрокаПолейУпорядочивания + ", ";
		КонецЕсли;
		СтрокаПолейУпорядочивания = СтрокаПолейУпорядочивания + ПолеКлюча;
	КонецЦикла;
	
	Если ТипЗнч(Отбор) = Тип("Массив") Тогда
		Отбор = СформироватьУсловиеОтбора(ПсевдонимТаблицы, Отбор);
	КонецЕсли;
	
	// Подготовка запросов для получения порций
	Если ПоляКлюча.Количество() = 0 Тогда 
		ШаблонЗапроса = // Общая часть запроса
		"ВЫБРАТЬ
		|&СтрокаПолейВыборки
		|ИЗ
		|	&Таблица
		|ГДЕ &Условие";
	Иначе
		// Размер порции устанавливается в методе ПолучитьПорциюДанныхНезависимогоНабораЗаписей
		ШаблонЗапроса = // Общая часть запроса
		"ВЫБРАТЬ ПЕРВЫЕ 999
		|&СтрокаПолейВыборки
		|ИЗ
		|	&Таблица
		|ГДЕ &Условие
		|УПОРЯДОЧИТЬ ПО
		|	&СтрокаПолейУпорядочивания";
	КонецЕсли;
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&СтрокаПолейВыборки", СтрокаПолейВыборки);
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&Таблица", 
		МетаданныеОбъекта.ПолноеИмя() + ДополнениеКИмениТаблицы + " КАК " + ПсевдонимТаблицы);
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&СтрокаПолейУпорядочивания", СтрокаПолейУпорядочивания);
	
	// Запрос для получения первой порции
	Если НЕ ПустаяСтрока(Отбор.УсловиеОтбора) Тогда
		ТекстЗапросаПолученияПервойПорции = СтрЗаменить(ШаблонЗапроса, "&Условие", Отбор.УсловиеОтбора);
	Иначе
		ТекстЗапросаПолученияПервойПорции = СтрЗаменить(ШаблонЗапроса, "ГДЕ &Условие", "");
	КонецЕсли;
	
	Запросы = Новый Массив; // Запросы для получения последующих порций
	Для СчетчикЗапросов = 0 По ПоляКлюча.ВГраница() Цикл
		
		СтрокаПолейУсловия = ""; // Часть текста запроса с полями условия
		ПоляУсловия = Новый Массив; // Поля участвующие в условии
		
		КоличествоПолейУсловий = ПоляКлюча.Количество() - СчетчикЗапросов;
		Для ИндексПоля = 0 По КоличествоПолейУсловий - 1 Цикл
			Если НЕ ПустаяСтрока(СтрокаПолейУсловия) Тогда
				СтрокаПолейУсловия = СтрокаПолейУсловия + " И ";
			КонецЕсли;
			
			ПолеКлюча = ПоляКлюча[ИндексПоля];
			
			Если ИндексПоля = КоличествоПолейУсловий - 1 Тогда
				ЛогическийОператор = ">";
			Иначе
				ЛогическийОператор = "=";
			КонецЕсли;
			
			СтрокаПолейУсловия = СтрокаПолейУсловия + ПсевдонимТаблицы + "." + ПолеКлюча + " " 
				+ ЛогическийОператор + " &" + ПолеКлюча;
				
			ПоляУсловия.Добавить(ПолеКлюча);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Отбор.УсловиеОтбора) Тогда
			СтрокаПолейУсловия = Отбор.УсловиеОтбора + " И " + СтрокаПолейУсловия;
		КонецЕсли;
		
		ОписаниеЗапроса = Новый Структура("Текст, ПоляУсловия");
		ОписаниеЗапроса.Текст = СтрЗаменить(ШаблонЗапроса, "&Условие", СтрокаПолейУсловия);
		ОписаниеЗапроса.ПоляУсловия = Новый ФиксированныйМассив(ПоляУсловия);
		
		Запросы.Добавить(Новый ФиксированнаяСтруктура(ОписаниеЗапроса));
		
	КонецЦикла;
	
	ОписанияЗапросов = Новый Структура;
	ОписанияЗапросов.Вставить("Первый", ТекстЗапросаПолученияПервойПорции);
	ОписанияЗапросов.Вставить("Последующие", Новый ФиксированныйМассив(Запросы));
	ОписанияЗапросов.Вставить("Параметры", Отбор.ПараметрыОтбора);
	
	СтруктураКлюча = Новый Структура; // Структура для хранения значения последнего ключа
	Для каждого ПолеКлюча Из ПоляКлюча Цикл
		СтруктураКлюча.Вставить(ПолеКлюча);
	КонецЦикла;
	
	Состояние = Новый Структура;
	Состояние.Вставить("Запросы", Новый ФиксированнаяСтруктура(ОписанияЗапросов));
	Состояние.Вставить("Ключ", СтруктураКлюча);
	Состояние.Вставить("БылаВыборка", Ложь);
	
	Возврат Состояние;
	
КонецФункции

Процедура ДобавитьРазделителиВКлюч(МетаданныеОбъекта, ПоляКлюча)
	
	Для Каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл 

		Если Не ОбщийРеквизит.ИспользованиеРазделяемыхДанных = 
			Метаданные.СвойстваОбъектов.ИспользованиеРазделяемыхДанныхОбщегоРеквизита.НезависимоИСовместно Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементОбщегоРеквизита = ОбщийРеквизит.Состав.Найти(МетаданныеОбъекта);
		Если ЭлементОбщегоРеквизита <> Неопределено Тогда
			
			Если ЭлементИспользуетсяВРазделителе(ОбщийРеквизит, ЭлементОбщегоРеквизита) Тогда  
				ПоляКлюча.Добавить(ОбщийРеквизит.Имя);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлементИспользуетсяВРазделителе(ОбщийРеквизит, ЭлементОбщегоРеквизита)
	
	АвтоИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита;
	ИспользованиеОбщегоРеквизита     = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита;
	
	Если ОбщийРеквизит.АвтоИспользование = АвтоИспользованиеОбщегоРеквизита.Использовать Тогда 
		Если ЭлементОбщегоРеквизита.Использование = ИспользованиеОбщегоРеквизита.Авто
			Или ЭлементОбщегоРеквизита.Использование = ИспользованиеОбщегоРеквизита.Использовать Тогда 
				Возврат Истина;
		Иначе
				Возврат Ложь;
		КонецЕсли;
	Иначе
		Если ЭлементОбщегоРеквизита.Использование = ИспользованиеОбщегоРеквизита.Авто
			Или ЭлементОбщегоРеквизита.Использование = ИспользованиеОбщегоРеквизита.НеИспользовать Тогда 
				Возврат Ложь;
		Иначе
				Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СформироватьУсловиеОтбора(ПсевдонимТаблицы, Отбор)
	
	СтрокаОтбора = ""; // Часть текста запроса с условием образованным отбором
	ПараметрыОтбора = Новый Структура;
	Если Отбор.Количество() > 0 Тогда
		Для каждого ОписаниеОтбора Из Отбор Цикл
			Если НЕ ПустаяСтрока(СтрокаОтбора) Тогда
				СтрокаОтбора = СтрокаОтбора + " И ";
			КонецЕсли;
			
			ИмяПараметра = "П" + Формат(ПараметрыОтбора.Количество(), "ЧН=0; ЧГ=");
			ПараметрыОтбора.Вставить(ИмяПараметра, ОписаниеОтбора.Значение);
			
			Операнд = "&" + ИмяПараметра;
			
			Если ОписаниеОтбора.ВидСравнения = ВидСравнения.Равно Тогда
				ЛогическийОператор = "=";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.НеРавно Тогда
				ЛогическийОператор = "<>";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.ВСписке Тогда
				ЛогическийОператор = "В";
				Операнд = "(" + Операнд + ")";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.НеВСписке Тогда
				ЛогическийОператор = "НЕ В";
				Операнд = "(" + Операнд + ")";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.Больше Тогда
				ЛогическийОператор = ">";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.БольшеИлиРавно Тогда
				ЛогическийОператор = ">=";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.Меньше Тогда
				ЛогическийОператор = "<";
			ИначеЕсли ОписаниеОтбора.ВидСравнения = ВидСравнения.МеньшеИлиРавно Тогда
				ЛогическийОператор = "<=";
			Иначе
				ШаблонСообщения = НСтр("ru = 'Вид сравнения %1 не поддерживается.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ОписаниеОтбора.ВидСравнения);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			СтрокаОтбора = СтрокаОтбора + ПсевдонимТаблицы + "." + ОписаниеОтбора.Поле + " " + ЛогическийОператор + " " + Операнд;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый Структура("УсловиеОтбора, ПараметрыОтбора", СтрокаОтбора, ПараметрыОтбора);
	
КонецФункции

// Формирует ключ для последовательности, который состоит из состава ее измерений.
//
// Параметры:
//	ОбъектМетаданных - ОбъектМетаданныхПоследовательность - объект метаданных последовательности.
//	СтрокаТаблицы - СтрокаТаблицыЗначений - строка в которой хранятся записи границ последовательностей.
//
// Возвращаемое значение:
//	Структура - ключ последовательности: Ключ - имя измерения, Значение - значение измерения.
//
Функция ПолучитьКлючПоследовательности(ОбъектМетаданных, СтрокаТаблицы)
	
	КлючПоследовательности = Новый Структура;
	
	Для Каждого Поле Из ОбъектМетаданных.Измерения Цикл
		КлючПоследовательности.Вставить(Поле.Имя, СтрокаТаблицы[Поле.Имя]);
	КонецЦикла;
	
	Возврат КлючПоследовательности;
	
КонецФункции

#КонецОбласти
